NextFOAM-2401/tutorials/multiphase/icoReactingMultiphaseInterFoam/solidMelting2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 301.3;

boundaryField
{
    left
    {
        type           fixedValue;
        value          uniform 311;
    }

    right
    {
        type           inletOutlet;
        inletValue     $internalField;
        value          $internalField;
    }

    bottom
    {
        type            zeroGradient;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
        value           $internalField;
    }

    frontAndBack
    {
        type           empty;
    }
}


// ************************************************************************* //
